import "../CSS/Essay.css";
function Essay(props) {

  let data = {
    "essayStart": [
      "如您所见，【{work}】这部作品自播出之后我便一直没有写评论。倒不是因为这部作品不值得评论或是单纯写出来没人看，不如说凭借着极高的制作水平和作品完成度，本作已经成为实至名归的十月番黑马。但也恰恰因为本作在画面上极富先锋性的实验和诸多大佬评论珠玉在前，我实在感到以自己对于影像薄弱的感知能力，自身实在没有写出更有裨益的评论的能力。于是便作为一期推介性质的评论，阐发一下【{work}】的{ep}话。",
      "第{ep}话做得实在太好了，有太多可讲之处，第二遍的时候边看边写观点不知不觉写得很长。可以说是本作到目前为止数一数二的一话。明天会写一篇长评，因而这篇只是简要地分享一下感受。",
      "这部片第{ep}话有几点恐怕是我无论如何都想讲的，长评这个点写不太合适，那就只能用短评写了，比较遗憾。",
      "EP{ep}实在是非常舒服的一话。这个舒服很有讲头。",
      "事先声明，这点我几天前就写完，（考虑到可能具有争议性）在频友的要求下才发，（算是免责声明），不是钓鱼。"
    ],

    "paragraphStart": [
      "昨晚地底人电台和第{ep}话播出后的频友评论我都尚且没有顾及去看，不过凭借着第{ep}话强大的制作阵容和画面星现，大致的情形恐怕是可以想见的。这便是本作最大的特质，凭借着极大的创作自由度和制作班底在画面上给观众带来的极富冲击力的体验。尤其是本话自动售货机前的一幕，实在做得极好。因而这是一部首先需要观众认真地欣赏以至于享受作品最直观的画面本身的作品。",
      "本话剧本总体上来说处于很微妙的状态，以放松的心情“图一乐”去看绝对是没有问题的，自然比起前两话有一定的滑坡。",
      "本话作为一个单元回，起承转合都要在20分钟的文本篇幅里完成。",
      "问题就出现在这个故事的起承转合均匀分散在了四天的时间里。",
      "不得已，制作组就只能简化本话的核心的故事的叙事逻辑。",
      "制作组只好出一不得已的下策，用戏剧的手段完成作品和新喜剧冲突的演绎，使得作品在行文节奏上的问题都仿佛是一出拙劣小品中犯的问题。",
      "在历史脉络中作为怀旧的对象指向了本作的某种母题，这点有待行文的进一步印证。",
      "本话登场的角色似乎不是一个活生生的角色，而是一个概念题或者是要素的集合。",
      "本话的文本叙事空间放在了两个小女孩的卧室中，本话的叙事也迎合了这种文本空间的倾向。",
      "对于这类作品，在文艺传统中我们一般称为之“非日常性（叙事下的）日常”。",
      "一般的部活性质的萌豚片总会因为怕观众无聊而减少一本正经的日常，而加入很多部活的要素，但其实也完全避免不了无聊。",
      "{work}这话值得称赞之处在于，让一部讲美少女的骗子回归到讲纯粹的美少女，并且很温柔地把故事讲好。",
      "之于本作中这样剑走偏锋的人物设计，两个问题需要被指出，其一，这些人物形象之于作品行文本身具有怎样的意义？其二，这些人物形象自身在行文中展露出了怎样的特质，迎合了怎样的叙事目标？",
      "在作品的画面之下，作品的叙事也成为本作讨论的一个重心。",
      "顺着之前几篇评论(【DIY】、【摇曳露营剧场版】)，我提出了这样一个观点，由于电视动画观影媒介的改变，不同的观影者在不同观影场合下以不同的心境观影，观众产生的对于作品的侧重与感触一定是大不相同的。",
      "在我看来，“{work}”是很不好阐发的一个主题。",
      "是故，本作所阐发的“{work}”一定不是且不能是作为一种感触而存在“孤独症”的体验，而是一种经过符号化处理过后的名为孤独在人身上体现出的表征的集合，比方说本作中{protagonist}身上具有的种种特质：不善于交流、内心阴暗却又极渴求与他人连接，在不断的挫折后受伤的内心，等等。",
      "那么回到问题本身。这样的“{work}”的体现真的指向了“{work}（症）”么？"
    ],
    "paragraphEnd": [
      "是故，作品整体上似乎呈现出一种“前现代”的作品风貌。",
      "这部作品被我视作是日本文艺的孤迹。",
      "那么，这些问题的下场就变成了被柔化, 消解，既不具备现实的指征亦对具体问题无能为力，(但同时)却消解了作品的纯粹性，这是我想阐发的问题。",
      "但同时这些要素被抛出来，这些问题被抛出来，作品本身没有法很好回答这个问题。",
      "甚至在这个层面上来说，恰是因为本作仍遵循着一种萌系番的创作体例完成的创作，他对于这些切实的社会问题是无能为力的，但是角色和观众却切实承担或者接受了这些问题抛出来时包含着的压力。",
      "而这一点，恰是美少女动画最难能可贵之处。",
      "因而与其分析作品的故事本身是否“真的”讲述了一个这样的故事，不如站在观众的立场上，阐发观众是如认识这一点的。"
    ],
    "juncture": [
      "但是在另一个侧面你也不能否定的是，",
      "我想这是不尽然的，不如说，",
      "但是，这又何曾是重要的呢。"
    ],
    "transit": [
      "顺着这点说，",
      "从狭隘视角来说，",
      "细究原因有很多，但最重要的一点将在行文中得到论证。",
      "日本动画的脚本仍是按照一种类似于戏剧的模式进行的编排，在作品中，以人物形象为载体的戏剧冲突一定是作品不变的核心。",
      "同时，在作品具体的呈现上，制作组又运用了大量漫符的要素和小剧场的形式完成波奇内心境遇的外化阐发。"
    ],
    "phasedSummary": [
      "关于这一点笔者将在接下来的行文中具体阐发",
      "这一定是解读本作的一条重要线索",
      "一般观众无法意识到作品桥段设计的趣味之所在",
      "这一段给了评论者很大的阐发空间",
      "这通常被认为违背了作品旨趣",
      "这一段成为了充实作品现实感和完成主人翁的内心建构的重要依凭",
      "这个主题在某种意义上成为了必要与必须，于是造成了批评者和作者间的紧张关系",
      "这在某种角度上来说也能解释日本动画对于校园主题的偏爱",
      "同时本话的叙事也要更复杂，结果就是真正用于核心叙事的空间被高度挤压",
      "其最重要的功用便是在一般的本土语境中给一个“大他者”的形象添加了一个微不足道的脚注",
      "少女们则是更进一步的，被“干净”的场域包裹着的存在。而这，便是根本的区隔",
      "因而，纯粹阐发独的作品，比方说郁达夫的【沉沦】一类的东西，是很不好搬上荧幕，更不适合用动画的形式完成阐发",
      "因而，在作品的行文中，外化的{protagonist}的孤独，不再指向{protagonist}当下内心的感触，而是指向一种过去经验的投影",
      "这就意味着这部作品绝非是一种打破了作品舞台和现实之间的界限，就有点类似于20世纪的那种百老汇城市舞台剧的意思",
      "因为这些要素的存在使得作品永远地被逐出传统萌系番的“伊甸园”，是好是坏不做评价",
      "就好像逃进夜之城的居民那样，“别无选择”",
    ],
    "reusable": [
      "因为我们是这样{verb}的，所以这种{noun}有一种{noun}性，这种{noun}性是让贫瘠的思想变得理解，而{noun}性是在这之上，包括这种{noun}性所以是{noun}性，因为我们知道了所以我们知道了。",
      "因为尽管具有无可奈何的事实，但是这个过程本身被{verb}，而这种{verb}却是一种{verb}性，{verb}性是一种淡薄的理解，我很明白这种{verb}性，所以说{verb}性就是一种{verb}。",
      "最终落实到{noun}这个要素，{noun}仍然是被景观化了的。不仅仅是作为大家的{noun}，包括出场角色那些路人的设计，他还是遵循着萌豚日常这样的一种文脉。",
      "所以说{work}的场景设定打破了之前萌系动画当中一个熟人社会或者一个童话般的作品舞台的设定，这是根本的区隔。但是同时我也承认，{protagonist}迈出去的这一步是不充分的，尽管引入了{adj}的“路人”的存在，尽管他们是路人，但是这些角色还是温柔过头了，是服务于作品叙事的，因而作品仍然按照着萌系日常作品的一条既有文脉在完成作品的铺陈。",
      "所以，我自己想阐发的是，{work}引入了{noun}，引入了{noun}，引入了{noun}，这些当代现实社会的问题，但是这部作品是无力去消解这些问题的。在作品中，{noun}被視作是一个角色的设定、{noun}不再是读者所确实感受到的那样（具有恶意），连带着作品对于城市的阐发与观众的认识间也具有张力。那么，这些问题的下场就变成了被{verb}、{verb}，既不具备现实的指征亦对具体的问题无能为力，（但同时）却消解了作品的{adj}，这是我想阐发的问题。针对故事本身，因而不只针对动画，但动画已经显露出这样的隐忧。"
    ],
    "content": [
      "这部作品当中确实引入了很多不会在一部传统萌系番体例当中出现的要素，比方说对SNS的讨论(作为一个YouTuber如何平衡自己的网络身份现实身份)。",
      "少女们最终被逐回城市，说是逐回其实是不恰当的，因为尽管具有无可奈何的实情，但是这个过程本身被严密的包装。",
      "故事便是记录“当下“我们”的活动，也就是所谓“切断了与历史的联系”。",
      "{work}被认为是激发出一种怀旧之情，这一点继承了日本文艺60年代之文脉，部室是存在于过去某一时期的具有{adj}的“幽灵”，造成了手制和mass production之间的紧张关系，这同时意味着部活两种生活方式的决裂。",
      "过去的生活方式被以当下进展的部活的形式成为了被凝视的, 被窥探的对象, 自上而下的窥探有一种被窥探者身居高位的意蕴，然而这一幕有意思的地方在于，与权力叙事相对的，被窥探者反而成为了作品叙事的重心和中心，窥探者反而出在了一个被边缘化的位置上。",
      "升学被认为是一个切实但遥不可及的概念，一种“隐忧”。",
      "尽管有升学的压力，但少女们仍然在余下的时间中尽情舒展自身的生命，某种意义上来说，更是由于这种隐忧的存在使得舒展自身的生命, 开展部活的历程变得更为紧迫，成为一种必要且必须。",
      "这样的窥探具有某种福柯“全景监狱”的意味，展现了一种权力关系的隐喻。",
      "最明显的捏他莫过于job子和造手机的隐喻指向某不知名水果公司老总。",
      "这种动画营造出来的氛围是很具有包容性的，伴随着舒缓的音乐，仿佛将阿宅包容进了这个熟识安稳的空间之中。",
      "{protagonist}所具有的人物形象属性也不知是个体性的要素的集合，而是一种文化符号的具象体现。",
      "这样的一种错置便是作品批判性的根源。不是一般认为的“复古”或者怀旧，而是对于这样一种（部分已成为既成事实）的权利秩序的颠覆。",
      "无意义的流动的世界得以借此 被框定和分割。",
      "在后工业化的社会中对抗虚无，使读者的具体经验成为提供意义的重要处所。",
      "而“{work}”恰恰是一种内心的体验，是一种私人性的感触，既不与他人产生很强的关联，同时又是一种无冲突秩序下的产物。",
      "我试图阐明，将舞台引向城市、将少女“逐入”声色场的{work}，成为萌系作品由“自然性审美”向“纯粹欲望消费”的历程中，与以往一切萌系日常作品间产生根本决断、形成分野的一部作品。",
      "分两点说，第一，第一话结局{protagonist}撞到了路人的这一幕，意味着作品引入了一个抽象的“他者”，即作为城市景观的必要构成，“陌生人”进入了作品的场域中。",
      "换而言之，{work}是顺应着从向阳点兔（包括明日酱）（这种半架空世界观），到摇曳登山（虽然引入现实地域但有自然性要素维持作品的干净）这样一步步进入社会的历程。",
      "但是又在此基础上更进一步、以至于完全摆脱“自然性审美”这一某种意义上根植于女校传统和自然主义趣味的母题。",
      "这在我看来是一个很根本的区别，此前作品中，不论是学园中的学生还是登山步的登山客，还是露营克，本质上这些人都是溶于舞台中的，并且特定的角色出场都服务于作品的叙事（比方说摇曳第二季中抚子烤蔬菜时遇到的两个小孩）。",
      "但是{work}的故事当中出现了很多“他们的存在是因为这是个城市因而必须有很多的路人”，是景观化了的存在，并且同时这些角色跟主角之间具有一种先天的紧张关系（包括这一话中那句“他们（观众）不是敌人”所具有的{protagonist}视他们为敌人的一种预设。"
    ],
    "adjective": [
      "自然性", "趣味性", "根本性", "象征性", "严肃性", "宿命性", "纯粹性", "异质性", "历史性", "图腾性", "异域性", "手性", "作者性"
    ],
    "noun": [
      "总括", "手制", "意象", "隐喻", "决裂", "少女", "属性", "空间", "场域", "常识", "隐忧", "迷幻剂", "部活", "部室", "区隔", "SNS", "偏执", "裨益", "分野", "母题"
    ],
    "verb": [
      "阐发", "搭建", "舒展", "包容", "包装", "异化", "麻痹", "景观化", "柔化", "消解"
    ],
    "suffix": [
      "【笑】。", "罢。", "（逃）。", "（bushi）。", "（误）。", "（认真）。"
    ],
    "conclusion": [
      "理论物理的终极，就是世界的终极，知识的终极，命运的终极，叙事和故事的终极，人类的终极。",
      "某种意义上来说这部作品揭示了自然性审美旨趣的最终破产。说到底这一点到现在才破产，还是比较值得玩味的。",
      "现实生活中，阿宅已经脱离了切实的和自然之间的联系，他们却在文艺作品的鉴赏当中执拗地坚持对于自然的少女的鉴赏，这最终是不可持续的。",
      "总体上来说便是让人感到各种怪味，用“00年代想象力”去概述似乎已经不是很合适，不如说本作的叙事是跳脱出日本动画狭隘视野的真正意义上的要素大杂烩。实在有些令人期待作品的后续。",
      "上次评论的结尾，这这里依旧起着效力。",
      "我想大约到此为止，周未如果可能的话我会做一个整理。",
      "而当观众们真诚地为作品所感染，当他们从每周的观影中汲取慰藉、得到放松的时候，我想，这个问题本身便早已不再重要。",
      "其余的便在长评中发表罢。",
      "自己的写作是以自身的认识为立足的，而自身的认识与一般的社会实情、与“常识”间究竟有着多大的区别，实在是不得而知的。自己的写作大抵也是受限于自己的见识和自己的心情的，一段时期以来自身压抑的情绪恐怕也会在自身的写作中反映。因而实在是道阻且长的事业、写作什么的。",
      "最后说句题外话，我察觉到一件很有意思的事情啊，最近几年有这样一种声音，那就是在fb和 Twitter消灭了博客之后，长文字的记录和书写在互联网上绝迹 ，就说这样一种生活方式被消灭了 。但是我观察到某位群友发的小作文实在是很有意思啊，能够在微博上发表一段，大约是1000字左右的评论，这件事情本身就包含着一种立场。就比方说，我自己目前为止是绝对不会允许自己发表出来，对于特定作品的评论之外，任何涉及现实要素的日记式的东西 。但是这位群友有幸，能够从他发表的这种文字当中，能够一窥这样一种上古的生活方式的可能性。然后就是对于文本本身的评论，来再引用一句很有名的话，那就是他的书写当中可是夹杂着太多他自己的东西了。 发表长段文字本身代表着一种揭露，采用一种生活式的口语式的流水账式的记录，代表着一种文学修辞方面的忽视 。 语言上，说句难听点的，跟我初中写的作文没什么区别，当然就相对应的省去了从字里行间当中咬文嚼字的那些功夫 。说实话很有意思 ，给人的一种感觉就是，这些东西本来应该说给自己的朋友听的，应该发在一种私人性的博客上发的。但是他却选择了SNS，并且好像还没有这种自觉 。当你意识到你自己发的这些东西，并且不是个半年内可见的话，你就会被特定 。真是让我感到很欢愉。这样的欢欣的感触实在是很久违的 ，仿佛让人置身于高中几年给别人评论作文时的那种兴致来 。",
      "最后说句题外话，想给广大群友一个忠告，有什么想说的，与其在互联网上乱发不如发群里，这是我的忠告，当然最好还是纸笔写下来 ，这是我引以为豪的习惯，那这样这些互联网中的傻逼就永远不会知道这个人内心当中，只留给自己的一块究竟是什么样的情形 。",
      "最后，我们在做互联网批判的时候，很重要的一点就是人的情感只能被少数几种规定了的表情符号来表述，这当然可以说是一种人的异化，但是这更重要的是一种对于人自身情感的一种削弱 。就1984老大哥他们也不会想到说人的情感居然能够这样被规定，这件事情其实是蛮可怕的 。别再用那么多的表情包，别再用那么多的表情，用你自己的语言和你的大脑去思考你当下的情绪和你的心情 ，而不是某种格式化了的少数几种情绪的排列组合 。花花绿绿的头像，花花绿绿的照片，风光的互联网表征底下，内心深处属于自己的角落，究竟留存些什么？ 这个问题是很需要思考的 。",
      "最后说句题外话，就是你们要搞清楚一件事情，我不是做这些事情给你们看的 。这就是我的生活习惯，这就是我创作的一个必要的要素 。我就是需要在写作之前完成那么多的brainstorming，完成那么多的联想，完成那么多的狂飙突进，这些实践的成果在经过转化才成为了一篇篇的文字，你们一定要懂得这样一种原理 。",
      "最后说句题外话，我花了很多次去说一件事情，阐明这样一个很基本的道理，你们发表意见不发表意见，发表怎么样的意见，在这件事情上是无济于事的，在这件事情上你们根本什么都不算 。爱看就看，爱被我刷屏就刷屏，不爱刷屏就退群，很简单的道理，你们就当好你们的观众，我就当好我的创作者，我们两个之间没有那么大的义务 。噢，对了，我还有另外一句话没说，我还以为这句话我已经成为了一种默认的预设：我现实当中能够有这样一种讨论的对象，我何苦来到互联网 。",
      "最后说句题外话，我这个人其实没有那种很强的控制欲，要有一堆粉丝或者多少fo多少关注来彰显自己的，没有的，我自己订运营目标也只不过是定一个运营目标而已，就好像我要练书法要考个级一样 。就是说现在的情况是这样的，你们把我耐心耗完把我惹毛掉了那就回归原点，我动态也不发了，我动态全发我私密性的软件里头 。我运营目标达到10万阅读量1000粉丝，然后我这个号我也不运营了，那我们就说拜拜了，那没问题的呀，我不是那种现实生活枯竭到需要靠互联网来取悦我自己的人 。说到底我自始至终都没有吧，那些冒犯我的人很放在眼里，因为这些都是无足轻重的，都是些互联网数据而已 ，他们都不是活生生的人 。在我这里唯一的衡量标准就是自己有没有受伤。自己的心情，我自己才是唯一重要的要素，你们要记住这一点，我没有把你们看得那么重 。",
      "玩不了就别玩了，我今天从互联网下线了，再见。"
    ],
    "tail": "以上。"
  };

  const getOneRandomItem = (array) => {
    return array[Math.floor(Math.random() * array.length)];
  }

  const getMultipleRandomItems = (array, n) => {
    return array.sort(() => .5 - Math.random()).slice(0,n);
  }

  const getOneReusable = () => {
    let reusable = getOneRandomItem(data.reusable);
    while(!reusableIsPopulated(reusable)) {
      reusable = reusable.replace("{verb}", getOneRandomItem(data.verb));
      reusable = reusable.replace("{noun}", getOneRandomItem(data.noun));
    }
    return reusable;
  }

  const reusableIsPopulated = (reusable) => {
    return !(reusable.includes("{verb}")) && !(reusable.includes("{noun}"));
  }

  const addSuffix = (text) => {
    let random = Math.random();
    let modified = text;
    if (random < 0.4) {
      modified = text + getOneRandomItem(data.suffix);
    } else {
      modified = text + "。";
    }
    return modified;
  }

  const generateParagraphBody = () => {
    let body = "";
    let random1 = Math.random();
    if (random1 < 0.33) {
      body += getOneRandomItem(data.juncture);
    } else if (random1 < 0.66) {
      body += getOneRandomItem(data.transit);
    }

    let random2 = Math.random();
    if (random2 < 0.45) {
      body += getOneReusable();
    } else {
      body += getMultipleRandomItems(data.content, 2)[0];
      body += getMultipleRandomItems(data.content, 2)[1];
    }
    body += addSuffix(getOneRandomItem(data.phasedSummary));
    return body;
  }

  const formatParagraph = (paragraph) => {
    let formatted = paragraph;
    formatted = formatted.replaceAll("{work}", props.work);
    formatted = formatted.replaceAll("{ep}", props.epNum);
    formatted = formatted.replaceAll("{protagonist}", props.protagonist);
    while(formatted.includes("{adj}")) {
      formatted = formatted.replace("{adj}", getOneRandomItem(data.adjective));
    }
    return formatted;
  }

  const generateParagraph = (starter) => {
    let paragraph = "";
    let random = Math.random();
    paragraph += starter;
    if (random < 0.5) {
      for (let i = 0; i < 3; i++) {
        paragraph += generateParagraphBody();
      }
    } else {
      for (let i = 0; i < 4; i++) {
        paragraph += generateParagraphBody();
      }
    }
    paragraph += getOneRandomItem(data.paragraphEnd);
    paragraph = formatParagraph(paragraph);
    return paragraph;
  }
  
  const generateParagraphs = () => {
    const starters = getMultipleRandomItems(data.paragraphStart, props.paragraphNum);
    return (starters.map((ele) => {
      return (<div>
        <p>{generateParagraph(ele)}</p><br />
      </div>)
    }))
  }

  return (
    <div className="essay">
      <p>【{props.work}】ep{props.epNum} 评论</p>
      <br />
      <p>{formatParagraph(getOneRandomItem(data.essayStart))}</p>
      <br />
      {generateParagraphs()}
      <p>{getOneRandomItem(data.conclusion)}</p>
      <br />
      <p>{data.tail}</p>
      <p style={{"text-align": "center"}}>Generated by @喜八君生成器</p>
    </div>
  );
}

export default Essay;